docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE41-a_configmaps.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


Run    [ 100% ] setup()
list   [   0% ]

running (0d00h00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m00.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m01.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m02.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m03.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m04.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m05.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m06.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m07.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m08.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m09.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m12.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m10.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m13.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m11.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m14.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m12.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m15.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m13.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m16.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m14.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m17.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m15.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m18.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m16.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m19.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m17.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m20.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m18.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m21.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m19.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m22.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m20.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m23.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m21.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m24.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m22.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m25.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m23.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m26.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m24.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m27.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m25.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m28.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m26.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m29.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m27.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m30.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m28.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m31.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m29.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m32.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m30.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m33.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m31.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m34.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m32.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m35.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m33.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m36.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m34.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m37.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m35.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m38.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m36.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m39.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m37.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m40.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m38.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m41.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m39.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m42.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m40.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m43.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m41.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m44.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m42.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m45.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m43.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m46.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m44.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m47.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m45.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m48.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m46.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m49.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m47.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m50.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m48.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m51.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m49.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m52.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m50.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m53.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m51.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m54.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m52.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m55.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m53.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m56.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m54.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m57.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m55.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m58.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m56.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m59.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m57.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h01m00.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m58.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h01m01.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m59.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h01m02.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h01m00.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h01m03.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h01m01.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h01m04.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h01m02.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h01m05.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h01m03.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h01m06.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h01m04.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h01m07.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h01m05.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h01m08.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m06.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m09.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m07.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m10.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m08.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m11.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m09.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m12.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m10.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m13.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m11.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m14.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h01m12.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h01m15.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h01m13.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h01m16.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h01m14.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h01m17.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h01m15.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h01m18.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h01m16.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h01m19.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h01m17.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h01m20.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h01m18.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h01m21.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h01m19.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h01m22.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h01m20.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h01m23.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h01m21.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h01m24.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h01m22.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h01m25.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h01m23.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h01m26.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h01m24.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h01m27.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h01m25.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h01m28.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h01m26.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h01m29.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h01m27.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h01m30.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h01m28.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h01m31.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h01m29.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h01m32.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h01m30.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h01m33.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h01m31.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h01m34.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h01m32.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h01m35.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h01m33.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h01m36.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h01m34.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h01m37.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h01m35.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h01m38.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h01m36.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h01m39.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h01m37.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h01m40.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h01m38.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h01m41.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h01m39.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h01m42.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h01m40.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h01m43.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h01m41.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h01m44.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h01m42.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h01m45.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h01m43.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h01m46.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h01m44.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h01m47.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h01m45.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h01m48.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m46.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m49.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m47.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m50.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m48.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m51.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m49.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m52.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m50.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m53.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m51.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m54.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h01m52.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h01m55.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m53.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m56.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m54.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m57.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m55.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m58.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m56.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m59.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m57.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h02m00.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m58.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h02m01.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h01m59.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h02m02.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h02m00.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h02m03.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h02m01.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h02m04.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h02m02.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h02m05.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h02m03.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h02m06.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h02m04.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h02m07.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h02m05.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h02m08.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h02m06.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h02m09.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h02m07.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h02m10.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h02m08.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h02m11.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h02m09.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h02m12.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h02m10.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h02m13.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h02m11.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h02m14.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h02m12.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h02m15.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h02m13.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h02m16.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h02m14.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h02m17.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h02m15.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h02m18.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h02m16.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h02m19.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h02m17.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h02m20.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h02m18.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h02m21.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h02m19.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h02m22.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h02m20.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h02m23.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h02m21.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h02m24.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h02m22.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h02m25.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h02m23.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h02m26.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h02m24.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h02m27.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h02m25.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h02m28.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h02m26.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h02m29.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h02m27.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h02m30.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h02m28.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h02m31.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h02m29.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h02m32.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h02m30.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h02m33.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h02m31.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h02m34.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h02m32.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h02m35.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h02m33.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h02m36.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h02m34.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h02m37.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h02m35.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h02m38.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m36.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m39.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m37.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m40.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m38.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m41.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m39.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m42.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m40.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m43.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m41.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m44.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h02m42.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h02m45.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h02m43.9s/24h0m0s  29/30 iters, 30 per VU

running (0d00h02m46.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h02m44.9s/24h0m0s  29/30 iters, 30 per VU

running (0d00h02m47.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h02m45.9s/24h0m0s  29/30 iters, 30 per VU

running (0d00h02m48.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h02m46.9s/24h0m0s  29/30 iters, 30 per VU

running (0d00h02m49.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h02m47.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing configmaps from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 6421      ✗ 0   
     data_received..................: 376 MB  2.2 MB/s
     data_sent......................: 2.1 MB  12 kB/s
     http_req_blocked...............: avg=44.95µs  min=220ns   med=270ns    max=9.69ms  p(90)=360ns   p(95)=411ns   
     http_req_connecting............: avg=9.59µs   min=0s      med=0s       max=1.77ms  p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=48.76ms  min=15.12ms med=34.06ms  max=1.21s   p(90)=50.99ms p(95)=130.14ms
       { expected_response:true }...: avg=48.76ms  min=15.12ms med=34.06ms  max=1.21s   p(90)=50.99ms p(95)=130.14ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 3211
     http_req_receiving.............: avg=1.07ms   min=50.31µs med=821.83µs max=38.76ms p(90)=1.4ms   p(95)=1.8ms   
     http_req_sending...............: avg=119.27µs min=30.5µs  med=47.75µs  max=5.63ms  p(90)=54.25µs p(95)=69.56µs 
     http_req_tls_handshaking.......: avg=33.42µs  min=0s      med=0s       max=6.1ms   p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=47.56ms  min=14.62ms med=33.05ms  max=1.21s   p(90)=49.2ms  p(95)=128.86ms
     http_reqs......................: 3211    18.952769/s
     iteration_duration.............: avg=5.46s    min=1.11s   med=5.63s    max=7.4s    p(90)=6.64s   p(95)=6.9s    
     iterations.....................: 30      0.177074/s
     vus............................: 1       min=0       max=1 
     vus_max........................: 1       min=1       max=1 


running (0d00h02m49.4s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h02m48.3s/24h0m0s  30/30 iters, 30 per VU